chat_system_1405621286_actor_description=Iron Richard. Mentor of all young knights.
chat_system_1405621286_snap_exit_question=^?^Hey, [player]! Stop!<br>Where are you going? You cannot leave this Hall until you pass the Test.
chat_system_1405621286_snap_exit_answer_0=^?^(Step away from the exit.)
chat_system_1405621286_snap_6_question=^?^Well well, [player], come. Stand still and listen to me closely.<br>Your entrance into this Hall means that the time of study is over and that a new part of your life is about to begin. It is time that you face the tests. Know that these tests will determine your destiny.<br>What will be your choice? As the top student you have the right to refuse the Test. In this case, I will decide by myself where you are to serve. I know you well, so I think you will be satisfied.
chat_system_1405621286_snap_6_answer_0=^?^I'm ready to pass the Test.
chat_system_1405621286_snap_6_answer_1=^?^I will refuse the Test and rely on your choice.
chat_system_1405621286_snap_3_question=^?^You do my heart good, [player]! - I'm proud of you. So, here's the first task.<br>Every self-respecting knight is obliged to kill dragons and save beautiful princesses. At least that's what the common people think, thanks to those catchy pop songs which the bards sing in the taverns. And we can't disappoint them, right?!<br>In the first room you will find a dragon, and a princess that you must save. Good luck!
chat_system_1405621286_snap_3_answer_0=^?^Excellent! Maybe I can collect a couple dragon fangs, for my magic elixirs.
chat_system_1405621286_snap_3_answer_1=^?^I'm a real warrior. You can't scare me with a dragon.
chat_system_1405621286_snap_3_header_1=^?^I wonder if it's courage or foolishness that guides your tongue. Anyway, a good sword will be useful to you. You can take one from the chest. I think you know what to do with it. After all, it was I who taught you the art of sword fighting.
chat_system_1405621286_snap_3_answer_2=^?^My faith will become my shield.
chat_system_1405621286_snap_3_header_2=^?^Maybe faith is a good shield, but a weapon still helps. Take the sword from the chest. I hope this time you don't have some stupid vow to worry us, like "ye shall not take a weapon after dawn." Ha ha...
chat_system_1405621286_snap_0_question=^?^Uh, yeah. Well magic is magic, but going against a dragon with your bare hands is pure suicide. You can take a sword from the chest.
chat_system_1405621286_snap_0_answer_0=^?^Am I supposed to beat a dragon with a training sword?
chat_system_1405621286_snap_0_answer_1=^?^Thank you for the sword. I'll use it well.
chat_system_1405621286_snap_5_question=^?^Of course, you can't handle the dragon by yourself. So a troop of Knights and Horsemen will go with you. We'll see how skilled a commander you are.<br>Of course, you may also act with cunning. Your task is to rescue the princess, so you may leave the dragon alive if you choose.<br>On the other hand, a real knight always goes bravely into combat, and combat experience is always a good thing. Alright, [player], go ahead.
chat_system_1405621286_snap_5_answer_0=^?^Now I'll sort this dragon out for sure. Thank you.
chat_system_1405621286_snap_1_question=^?^Let it be, [player]. In the name of all the Council of Mentors of the Knight's School of Darion, I, Senior Mentor Iron Richard proclaim you to be a full knight.<br>Be honest and fair. Carry the title with pride and dignity. And may your deeds for the glory of Darion, and your knight's honor, bring you fame throughout the centuries.
chat_system_1405621286_snap_1_answer_0=^?^I serve Darion.
chat_system_1405621286_snap_give_paket_question=^?^I am recommending you for the royal service as a Treasure Searcher. Here, take these reference letters to his Majesty, King Mark the Wise.<br>And don't forget your teacher! Come by to the Knight's Temple whenever you like. I will always be glad to see you. After these years together, you've become almost like a son to me. Young, high spirited and certainly talented, you'll become a fine knight. Now get out of here, they're waiting for you in the castle, and I've got a couple more of you knuckleheads that I need to test.
chat_system_1405621286_snap_give_paket_answer_0=^?^Thank you mentor! See you later.
chat_system_1405621286_snap_no_question=^?^Come on, come on, the exit is right in front of you. You are detaining other students from passing their Tests. Besides, you shouldn't make His Majesty wait.
chat_system_1405621286_snap_no_answer_0=^?^Alright, I'm leaving.
